<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "https://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest TextMate 2.

BRANCH can be one of 'release' or 'beta', which correspond respectively
to the 'Normal' and 'Nightly' options in TextMate 2's Software Update
preferences panel.
</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.TextMate2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TextMate2</string>
        <key>BRANCH</key>
        <string>release</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>TextMateURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>branch</key>
                <string>%BRANCH%</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>TextMate2.tar.bz2</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
