<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "https://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Adium.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.Adium</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Adium</string>
        <key>BRANCH</key>
        <string>release</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>http://www.adium.im/sparkle/update.php</string>
                <key>appcast_query_pairs</key>
                <dict>
                    <key>generation</key>
                    <string>2</string>
                    <key>type</key>
                    <string>%BRANCH%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
