<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "https://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Fetches the latest Sassafras KeyClient Mac installer.

REVISION is the major version without a decimal, for example:
7.0: 70
7.1: 71
7.2: 72

This recipe supports only a REVISION of 70 and up.
</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.sassafras-k2client</string>
    <key>Input</key>
    <dict>
        <key>REVISION</key>
        <string>72</string>
        <key>NAME</key>
        <string>K2Client</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.sassafras.com/k2/revisions%REVISION%/current/Installers/Macintosh%20Installers/Client/K2Client.pkg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
