<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "https://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Cyberduck.

Alternate URLs that can be used for SPARKLE_FEED_URL:
- beta: http://version.cyberduck.ch/beta/changelog.rss
- nightly: http://version.cyberduck.ch/nightly/changelog.rss
</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.Cyberduck</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Cyberduck</string>
        <key>SPARKLE_FEED_URL</key>
        <string>http://version.cyberduck.ch/changelog.rss</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SPARKLE_FEED_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
